---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.TooLargeNumberOfBars
source: html/a4b12108-fb91-5307-c28e-12afb58a250d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.TooLargeNumberOfBars Property

Rebar Set must contain at most 1002 bar locations.

## Syntax (C#)
```csharp
public static FailureDefinitionId TooLargeNumberOfBars { get; }
```